InformationRegisters/ОстаткиОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОстаткиОборудования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаказНарядИд</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОборудованиеСтр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>дтСинхро</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказНарядДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерОборудования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>33</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОстаткиОборудования/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Процедура ОбновитьСписокНаСервере()
	глВыгрузкаДанных.ЗагрузитьОстаткиЗаказНаряды();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	ОбновитьСписокНаСервере();
	Элементы.Список.Обновить(); 
КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	текСтр = Элементы.Список.ТекущиеДанные;
	Если спкЗаказов.НайтиПоЗначению(текСтр.ЗаказНаряд)=Неопределено ТОгда
		Стк = новый Структура("ЗаказНарядИд,ОборудованиеСтр,ЗаказНаряд,НомерОборудования");
		ЗаполнитьЗначенияСвойств(Стк,текстр);
		спкЗаказов.Добавить(стк,""+СокрЛП(текСтр.ЗаказНаряд)+" "+текСтр.ОборудованиеСтр);
	КонецеСЛИ;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Контрагент",Контрагент);
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМасКА()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ DISTINCT
	               |	ОстаткиОборудования.Контрагент КАК Контрагент
	               |ИЗ
	               |	РегистрСведений.ОстаткиОборудования КАК ОстаткиОборудования";
	Мас = новый Массив;
	Выб = Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		Мас.Добавить(Выб.Контрагент);
	КонецЦикла;
	
	Возврат Мас;
	
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	
	//текЭЛ = Элементы.КомпоновщикНастроекПользовательскиеНастройкиЭлемент0Значение;
	//текЭЛ.КнопкаВыпадающегоСписка = Истина;
	текЭл = элементы.Контрагент;
	текЭл.СписокВыбора.ЗагрузитьЗначения(ПолучитьМасКА()); 
	текЭл.РедактированиеТекста = Ложь;
	
	Контрагент = Контрагент;
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	//Вставить содержимое обработчика
КонецПроцедуры


&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ЭтаФорма.Закрыть(спкЗаказов.ВыгрузитьЗначения());
КонецПроцедуры


&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	поле = Новый ПолеКомпоновкиДанных("Контрагент");
	
	новЭл = Неопределено;
	
	Для каждого эл из Список.Отбор.Элементы Цикл
		Если Эл.ЛевоеЗначение = поле Тогда
			новЭл = Эл;
		КонецеСЛИ;
	Конеццикла;

	Если новЭл = Неопределено Тогда
		новЭл = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		новЭл.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		новЭл.ЛевоеЗначение = поле;
	КонецЕСЛИ;
	новЭл.ПравоеЗначение = Контрагент;
	новЭл.Использование = СокрЛП(Контрагент)<>"";
	
	//Для каждого эл из Список.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
	//	Если Эл.ЛевоеЗначение = поле Тогда
	//		эл.ПравоеЗначение = Контрагент;
	//		эл.Использование = СокрЛП(Контрагент)<>"";
	//	КонецеСЛИ;
	//Конеццикла;
		
КонецПроцедуры


&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры
